export var chatList = [
    {
        id: 1,
        avatar: '/assets/img/avatar_50x50.png',
        title: 'Константин Константинопольский',
        lastmsg: 'изображение',
        time: '15:00',
        count: '1'
    },
    {
        id: 2,
        isActive: true,
        avatar: '/assets/img/avatar_50x50.png',
        title: 'Антошка',
        lastmsg: 'Пошли копать картошку, дили-дили-трали-вали это мы не проходили, это нам не задавали',
        time: '9:57',
        isSelf: true
    },
    {
        id: 3,
        avatar: '/assets/img/avatar_50x50.png',
        title: 'Паша Работа',
        lastmsg: 'Привет! Как дела?',
        time: 'Вс',
        count: '1'
    },
    {
        id: 4,
        avatar: '/assets/img/avatar_50x50.png',
        title: '10 Невероятных фактов',
        lastmsg: 'Факт №1. А вы знали, что у длинноголового хвостоклювиков совсем нет хвоста сзади, он у них болтается спереди',
        time: 'Сб'
    },
    {
        id: 5,
        avatar: '/assets/img/avatar_50x50.png',
        title: 'TEDx',
        lastmsg: 'Лекция о том как стать фронтенд разаработчиком и не быть полным нулём в бэкенде',
        time: 'Сб'
    },
    {
        id: 6,
        avatar: '/assets/img/avatar_50x50.png',
        title: 'Иван Иванович',
        lastmsg: 'Иван Иванович, добрый день. Хочу напомнить про встрече, запланированной на завтра.',
        time: 'Пт',
        isSelf: true
    },
    {
        id: 7,
        avatar: '/assets/img/avatar_50x50.png',
        title: 'Жена',
        lastmsg: 'Хлеб, молоко, индейка, овощи, йогурт детям, корм для кошки, заедь в гараж за картошкой. привет',
        time: 'Чт',
        count: '99+'
    },
    {
        id: 8,
        avatar: '/assets/img/avatar_50x50.png',
        title: 'КиноНаходка...',
        lastmsg: 'Только у нас все премьеры этой недели в отличном качестве!',
        time: 'Чт',
        count: '14'
    },
    {
        id: 9,
        avatar: '/assets/img/avatar_50x50.png',
        title: '1-2-3',
        lastmsg: 'ОК',
        time: 'Ср',
        isSelf: true
    },
    {
        id: 10,
        avatar: '/assets/img/avatar_50x50.png',
        title: 'Вася Диагност',
        lastmsg: 'Машина готова, приезжай',
        time: 'Ср',
        count: '1'
    }
];
export var chatContentData = {
    title: 'Антошка',
    avatar: '/assets/img/avatar_30x30.png',
    messageList: [
        {
            type: 'date',
            msgContent: '19 ноября'
        },
        {
            type: 'text',
            msgContent: "\n\u041F\u0440\u0438\u0432\u0435\u0442! \u0421\u043C\u043E\u0442\u0440\u0438, \u0442\u0443\u0442 \u0432\u0441\u043F\u043B\u044B\u043B \u0438\u043D\u0442\u0435\u0440\u0435\u0441\u043D\u044B\u0439 \u043A\u0443\u0441\u043E\u043A \u043B\u0443\u043D\u043D\u043E\u0439 \u043A\u043E\u0441\u043C\u0438\u0447\u0435\u0441\u043A\u043E\u0439 \u0438\u0441\u0442\u043E\u0440\u0438\u0438 \u2014 \u041D\u0410\u0421\u0410 \u0432 \u043A\u0430\u043A\u043E\u0439-\u0442\u043E \u043C\u043E\u043C\u0435\u043D\u0442 \u043F\u043E\u043F\u0440\u043E\u0441\u0438\u043B\u0430 \u0425\u0430\u0441\u0441\u0435\u043B\u044C\u0431\u043B\u0430\u0434 \u0430\u0434\u0430\u043F\u0442\u0438\u0440\u043E\u0432\u0430\u0442\u044C \u043C\u043E\u0434\u0435\u043B\u044C SWC \u0434\u043B\u044F \u043F\u043E\u043B\u0435\u0442\u043E\u0432 \u043D\u0430 \u041B\u0443\u043D\u0443. \u0421\u0435\u0439\u0447\u0430\u0441 \u043C\u044B \u0432\u0441\u0435 \u0437\u043D\u0430\u0435\u043C \u0447\u0442\u043E \u0430\u0441\u0442\u0440\u043E\u043D\u0430\u0432\u0442\u044B \u043B\u0435\u0442\u0430\u043B\u0438 \u0441 \u043C\u043E\u0434\u0435\u043B\u044C\u044E 500 EL \u2014 \u0438 \u043A \u0441\u043B\u043E\u0432\u0443 \u0433\u043E\u0432\u043E\u0440\u044F, \u0432\u0441\u0435 \u0442\u0443\u0448\u043A\u0438 \u044D\u0442\u0438\u0445 \u043A\u0430\u043C\u0435\u0440 \u0432\u0441\u0435 \u0435\u0449\u0435 \u043D\u0430\u0445\u043E\u0434\u044F\u0442\u0441\u044F \u043D\u0430 \u043F\u043E\u0432\u0435\u0440\u0445\u043D\u043E\u0441\u0442\u0438 \u041B\u0443\u043D\u044B, \u0442\u0430\u043A \u043A\u0430\u043A \u0430\u0441\u0442\u0440\u043E\u043D\u0430\u0432\u0442\u044B \u0441 \u0441\u043E\u0431\u043E\u0439 \u0437\u0430\u0431\u0440\u0430\u043B\u0438 \u0442\u043E\u043B\u044C\u043A\u043E \u043A\u0430\u0441\u0441\u0435\u0442\u044B \u0441 \u043F\u043B\u0435\u043D\u043A\u043E\u0439.   \n\n\u0425\u0430\u0441\u0441\u0435\u043B\u044C\u0431\u043B\u0430\u0434 \u0432 \u0438\u0442\u043E\u0433\u0435 \u0430\u0434\u0430\u043F\u0442\u0438\u0440\u043E\u0432\u0430\u043B SWC \u0434\u043B\u044F \u043A\u043E\u0441\u043C\u043E\u0441\u0430, \u043D\u043E \u0447\u0442\u043E-\u0442\u043E \u043F\u043E\u0448\u043B\u043E \u043D\u0435 \u0442\u0430\u043A \u0438 \u043D\u0430 \u0440\u0430\u043A\u0435\u0442\u0443 \u043E\u043D\u0438 \u0442\u0430\u043A \u043D\u0438\u043A\u043E\u0433\u0434\u0430 \u0438 \u043D\u0435 \u043F\u043E\u043F\u0430\u043B\u0438. \u0412\u0441\u0435\u0433\u043E \u0438\u0445 \u0431\u044B\u043B\u043E \u043F\u0440\u043E\u0438\u0437\u0432\u0435\u0434\u0435\u043D\u043E 25 \u0448\u0442\u0443\u043A, \u043E\u0434\u043D\u0443 \u0438\u0437 \u043D\u0438\u0445 \u043D\u0435\u0434\u0430\u0432\u043D\u043E \u043F\u0440\u043E\u0434\u0430\u043B\u0438 \u043D\u0430 \u0430\u0443\u043A\u0446\u0438\u043E\u043D\u0435 \u0437\u0430 45000 \u0435\u0432\u0440\u043E.",
            time: '08:56'
        },
        {
            type: 'image',
            msgContent: '/assets/img/message_img_640x400.png',
            time: '08:56'
        },
        {
            isSelf: true,
            status: 'read',
            type: 'text',
            msgContent: 'Пошли копать картошку, дили-дили-трали-вали это мы не проходили, это нам не задавали...',
            time: '09:57'
        }
    ]
};
//# sourceMappingURL=data.js.map